
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_firewall.fw_tempssh will be updated in-place
  ~ resource "google_compute_firewall" "fw_tempssh" {
      ~ disabled                = false -> true
        id                      = "projects/fluted-result-476220-j1/global/firewalls/edup92vault-firewall-tempssh"
        name                    = "edup92vault-firewall-tempssh"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.file_pem_ssh will be created
  + resource "local_file" "file_pem_ssh" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "/tmp/pem_ssh"
      + id                   = (known after apply)
    }

  # null_resource.null_ansible_install is tainted, so must be replaced
-/+ resource "null_resource" "null_ansible_install" {
      ~ id       = "2861194780199801265" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
